students = [
    {'姓名': '张一', '年龄': 20, '性别': '女', '爱好': '跳舞', '成绩': 90, '城市': '吉安'},
    {'姓名': '张二', '年龄': 15, '性别': '女', '爱好': '跳舞', '成绩': 90, '城市': '吉安'},
    {'姓名': '张三', '年龄': 20, '性别': '女', '爱好': '跳舞', '成绩': 90, '城市': '吉安'},
    {'姓名': '李四', '年龄': 25, '性别': '女', '爱好': '跳舞', '成绩': 80, '城市': '新余'},
    {'姓名': '李五', '年龄': 25, '性别': '女', '爱好': '跳舞', '成绩': 80, '城市': '新余'},
    {'姓名': '李六', '年龄': 25, '性别': '女', '爱好': '跳舞', '成绩': 80, '城市': '新余'},
    {'姓名': '王五', '年龄': 20, '性别': '女', '爱好': '跳舞', '成绩': 60, '城市': '宜春'},
    {'姓名': '王六', '年龄': 21, '性别': '女', '爱好': '跳舞', '成绩': 90, '城市': '宜春'},
    {'姓名': '王七', '年龄': 20, '性别': '女', '爱好': '跳舞', '成绩': 70, '城市': '宜春'},
    {'姓名': '老六', '年龄': 22, '性别': '女', '爱好': '跳舞', '成绩': 50, '城市': '吉安'},
    {'姓名': '李华', '年龄': 20, '性别': '女', '爱好': '跳舞', '成绩': 60, '城市': '吉安'}
]


def city2(arr):
    stort = {}
    for stu in arr:
        city = stu['城市']
        score = stu['成绩']
        # 当键为城市不存在的时候,新建字典(第一层字典)
        if city not in stort:
            stort[city] = {
                'city_num': 0,
                'city_sum': 0,
            } 
        data = stort[city]
        data['city_num'] += 1
        data['city_sum'] += score
    for city3, data in stort.items():
        avg = data['city_sum'] / data['city_num']
        print(f"{city3}市平均成绩：{avg:.2f}")
    max_score = -1
    for stu in arr:
        if stu['成绩'] > max_score:
            max_score = stu['成绩']
    max_name = []
    for stu in arr:
        if stu['成绩'] == max_score:
            max_name.append(stu['姓名'])
    print(f"班级最高分是：{max_score},学生是：{','.join(max_name)}")


city2(students)
