import 函数

students = [
    {'姓名': '张一', '年龄': 20, '性别': '女', '爱好': '跳舞', '成绩': 98, '城市': '北京'},
    {'姓名': '张二', '年龄': 15, '性别': '女', '爱好': '跳舞', '成绩': 92, '城市': '北京'},
    {'姓名': '张三', '年龄': 20, '性别': '女', '爱好': '跳舞', '成绩': 94, '城市': '北京'},
    {'姓名': '李四', '年龄': 25, '性别': '女', '爱好': '跳舞', '成绩': 50, '城市': '新余'},
    {'姓名': '李五', '年龄': 25, '性别': '女', '爱好': '跳舞', '成绩': 80, '城市': '新余'},
    {'姓名': '李六', '年龄': 25, '性别': '女', '爱好': '跳舞', '成绩': 80, '城市': '新余'},
    {'姓名': '王五', '年龄': 20, '性别': '女', '爱好': '跳舞', '成绩': 60, '城市': '上海'},
    {'姓名': '王六', '年龄': 21, '性别': '女', '爱好': '跳舞', '成绩': 90, '城市': '上海'},
    {'姓名': '王七', '年龄': 20, '性别': '女', '爱好': '跳舞', '成绩': 70, '城市': '上海'},
    {'姓名': '老六', '年龄': 22, '性别': '女', '爱好': '跳舞', '成绩': 50, '城市': '北京'},
    {'姓名': '李华', '年龄': 20, '性别': '女', '爱好': '跳舞', '成绩': 60, '城市': '北京'}
]


def main(Arry):
    while True:
        try:
            oper = int(input("1.统计各个地区的学生人数\n"
                             "2.查找分数低于80分的学生\n"
                             "3.查找分数大于90的学生\n"
                             "4.查找来自上海且分数低于85分的学生\n"
                             "5.查找来自北京且分数高于95分的顶尖学生\n"
                             "6.退出查找\n:"))
        except ValueError:
            print("请输入数字1~5")

            continue
        if oper == 1:
            print(f"======================\n{函数.people(Arry)}\n=============================")

        elif oper == 2:
            print(f"======================\n小于80的同学有：{函数.eightScore(Arry)}\n=============================")
        elif oper == 3:
            print(f"======================\n大于90的同学有：{函数.nineScore(Arry)}\n===============================")
        elif oper == 4:
            print(f"======================\n上海小于85分的同学有:{函数.cityShangHai(Arry)}\n========================")
        elif oper == 5:
            print(f"======================\n北京大于95分的顶尖学生有：{函数.cityBJ(Arry)}\n===========================")
        elif oper == 6:
            break
main(students)
print("退出成绩查找程序！！！")