list_1 = [90, False, "hello", ["list2"], ("元组", "tuple"), {"集合", "set"}, {"字典": "dict"}, 80, True]

# 获取列表总长度
lengs = len(list_1)
print(lengs)  # 9

# 切片 [-9:6]
print(list_1[-9:6])
# 按步骤来：[-9:6] = [0:6] 0 < 6 ，且步长为正，则切片不为空。从左往右，左闭右开
# [-9:6] = [0:6] = [90, False, "hello", ["list2"], ("元组", "tuple"), {"集合", "set"}]
# {"集合", "set"} 是一个集合(set)顺序可能会被打乱

# 切片 [6:-8:-1]
print(list_1[6:-8:-1])
# 按步骤来：[6:-8:-1] = [6:1:-1] 6 > 1 ，且步长为负数，则切片不为空，从右往左，左闭右开
# [6:-8:-1] = [6:1:-1] = [{"字典": "dict"}, {"集合", "set"}, ("元组", "tuple"), ["list2"], "hello"]
# {"集合", "set"} 是一个集合(set)顺序可能会被打乱

# 以上案例，步长相反，即是空切片
print(list_1[-9:6:-1])
# 按步骤来：[-9:6:-1] = [0:6] 0 < 6 ，且步长为负数，则切片为空
print(list_1[6:-8])
# 按步骤来：[6:-8] = [6:1:-1] 6 < 1 ，且步长为正，则切片为空
