students = [
    {'姓名': '张一', '年龄': 20, '性别': '女', '爱好': '跳舞', '成绩': 90, '城市': '吉安'},
    {'姓名': '张二', '年龄': 15, '性别': '女', '爱好': '跳舞', '成绩': 90, '城市': '吉安'},
    {'姓名': '张三', '年龄': 20, '性别': '女', '爱好': '跳舞', '成绩': 90, '城市': '吉安'},
    {'姓名': '李四', '年龄': 25, '性别': '女', '爱好': '跳舞', '成绩': 80, '城市': '新余'},
    {'姓名': '李五', '年龄': 25, '性别': '女', '爱好': '跳舞', '成绩': 80, '城市': '新余'},
    {'姓名': '李六', '年龄': 25, '性别': '女', '爱好': '跳舞', '成绩': 80, '城市': '新余'},
    {'姓名': '王五', '年龄': 20, '性别': '女', '爱好': '跳舞', '成绩': 60, '城市': '宜春'},
    {'姓名': '王六', '年龄': 21, '性别': '女', '爱好': '跳舞', '成绩': 90, '城市': '宜春'},
    {'姓名': '王七', '年龄': 20, '性别': '女', '爱好': '跳舞', '成绩': 70, '城市': '宜春'},
    {'姓名': '老六', '年龄': 22, '性别': '女', '爱好': '跳舞', '成绩': 50, '城市': '吉安'},
    {'姓名': '李华', '年龄': 20, '性别': '女', '爱好': '跳舞', '成绩': 60, '城市': '吉安'}
]


class Class:
    def __init__(self, ClassName, headcount, form_teacher, Students):
        self.班级名 = ClassName
        self.人数 = headcount
        self.班主任 = form_teacher
        self.班级学生表 = Students

    def JG(self):
        result = []
        for stu in self.班级学生表:
            if stu["成绩"] <= 60:
                score = "不合格"
            else:
                score = "合格"
            result.append(f"{stu['姓名']}：{score}")
        return "\n".join(result)

    def AVG(self):
        headcount = 0
        sum = 0
        for stu in self.班级学生表:
            headcount += 1
            sum += stu["年龄"]
        if headcount == 0:
            return 0
        return f"平均年龄是:{sum / headcount:.2f}"


Clss01 = Class("25303", "11", "W", students)
print(Clss01.班级名, Clss01.人数, Clss01.班主任, Clss01.班级学生表)
print(Clss01.JG())
print(Clss01.AVG())
